In [97]:
import sqlite3
import pandas as pd

# Instantiation and Exploration

In [128]:
chinook = sqlite3.connect("/Users/digitalisdiana/Downloads/chinook.db")
chinook

In [129]:
curs = chinook.cursor()

In [100]:
curs.execute("SELECT name FROM sqlite_master WHERE type = 'table'")

In [101]:
curs.execute("SELECT * FROM Customers").description

(('CustomerId', None, None, None, None, None, None),
 ('FirstName', None, None, None, None, None, None),
 ('LastName', None, None, None, None, None, None),
 ('Company', None, None, None, None, None, None),
 ('Address', None, None, None, None, None, None),
 ('City', None, None, None, None, None, None),
 ('State', None, None, None, None, None, None),
 ('Country', None, None, None, None, None, None),
 ('PostalCode', None, None, None, None, None, None),
 ('Phone', None, None, None, None, None, None),
 ('Fax', None, None, None, None, None, None),
 ('Email', None, None, None, None, None, None),
 ('SupportRepId', None, None, None, None, None, None))

In [102]:
customers = curs.fetchall()

In [103]:
customers = pd.DataFrame(customers, columns = ['CustomerId','FirstName','LastName','Company','Address','City','State','Country','PostalCode','Phone','Fax','Email','SupportRepId' ])
customers.head()

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
1,2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
2,3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
3,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
4,5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [104]:
customers = customers.set_index(["CustomerId"])

In [105]:
customers.head()

,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
CustomerId,,,,,,,,,,,,
1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [106]:
customers.shape

(59, 12)

In [107]:
curs.execute("SELECT * FROM Invoices").description

(('InvoiceId', None, None, None, None, None, None),
 ('CustomerId', None, None, None, None, None, None),
 ('InvoiceDate', None, None, None, None, None, None),
 ('BillingAddress', None, None, None, None, None, None),
 ('BillingCity', None, None, None, None, None, None),
 ('BillingState', None, None, None, None, None, None),
 ('BillingCountry', None, None, None, None, None, None),
 ('BillingPostalCode', None, None, None, None, None, None),
 ('Total', None, None, None, None, None, None))

In [113]:
invoices = curs.fetchall()
invoices = pd.DataFrame(invoices, columns = ["InvoiceId",'CustomerId', 'InvoiceDate', 'BillingAddress', 'BillingCity', 'BillingState', 'BillingCountry', 'BillingPostalCode', 'Total'])

01. Selectionner les clients (table customers) qui ne sont ni aux USA, ni en France.

In [116]:
curs.execute("SELECT * FROM Customers WHERE Country not in ('USA', 'France')").description
req1 = curs.fetchall()
req1 = pd.DataFrame(req1, columns = ['CustomerId','FirstName','LastName','Company','Address','City','State','Country','PostalCode','Phone','Fax','Email','SupportRepId' ])

In [117]:
req1.shape

(41, 13)

02. Selectionner tous les albums (table albums) de l'artiste (table artists) enregistré juste après l'artiste nommé "Amy Winehouse" (en plusieurs étapes, que vous décrirez).

In [118]:
curs.execute("SELECT * FROM Artists").description

(('ArtistId', None, None, None, None, None, None),
 ('Name', None, None, None, None, None, None))

In [119]:
req1_ = curs.fetchall()

In [120]:
req1_ = pd.DataFrame(req1_, columns = ['ArtistId','Name'])
amy = req1_[req1_["Name"] == "Amy Winehouse"]
amy

     ArtistId           Name
251       252  Amy Winehouse

In [121]:
curs.execute("SELECT * FROM Albums WHERE ArtistId == 252").description

(('AlbumId', None, None, None, None, None, None),
 ('Title', None, None, None, None, None, None),
 ('ArtistId', None, None, None, None, None, None))

In [122]:
req2 = curs.fetchone()
req2 = pd.DataFrame(req1_, columns = ["AlbumId", "Title", "ArtistId"])
amy_alb = req2[req2["ArtistId"] == 252]
amy_alb

     AlbumId  Title  ArtistId
251      NaN    NaN       252

03. Sélectionner tous les artistes (table artists) dont le nom possède un "s minuscule" ni au début, ni à la fin, uniquement au milieu de nom.

In [123]:
curs.execute("SELECT * FROM Artists WHERE Name NOT LIKE 's%'AND Name NOT LIKE '%s' AND Name LIKE '%s%'").description
req3 = curs.fetchall()
req3 = pd.DataFrame(req3, columns = ['ArtistId','Name'])

In [124]:
req3.head()

   ArtistId                  Name
0         4     Alanis Morissette
1         6  Antônio Carlos Jobim
2         8            Audioslave
3        11   Black Label Society
4        12         Black Sabbath

04. Séléctionner toutes les pistes (table tracks) dont le champ compositeur (colonne composer) n'a pas été renseigné.

In [125]:
curs.execute("SELECT * FROM Tracks WHERE Composer IS NULL").description

(('TrackId', None, None, None, None, None, None),
 ('Name', None, None, None, None, None, None),
 ('AlbumId', None, None, None, None, None, None),
 ('MediaTypeId', None, None, None, None, None, None),
 ('GenreId', None, None, None, None, None, None),
 ('Composer', None, None, None, None, None, None),
 ('Milliseconds', None, None, None, None, None, None),
 ('Bytes', None, None, None, None, None, None),
 ('UnitPrice', None, None, None, None, None, None))

In [126]:
req4 = curs.fetchall()
req4 = pd.DataFrame(req4, columns = ['TrackId', 'Name', 'AlbumId', 'MediaTypeId', 'GenreId', 'Composer', 'Milliseconds', 'Bytes', 'UnitPrice'])
req4.head()

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,2,Balls to the Wall,2,2,1,None,342562,5510424,0.99
1,63,Desafinado,8,1,2,None,185338,5990473,0.99
2,64,Garota De Ipanema,8,1,2,None,285048,9348428,0.99
3,65,Samba De Uma Nota Só (One Note Samba),8,1,2,None,137273,4535401,0.99
4,66,Por Causa De Você,8,1,2,None,169900,5536496,0.99

05. Sélectioner dans la table des pistes (table tracks) le nom des 20 premières pistes.

In [ ]:
curs.execute("SELECT * FROM Tracks LIMIT 20").description

In [ ]:
req5 = curs.fetchall()
req5 = pd.DataFrame(req5, columns = ['TrackId', 'Name', 'AlbumId', 'MediaTypeId', 'GenreId', 'Composer', 'Milliseconds', 'Bytes', 'UnitPrice'])
req5

06. Sélectioner dans la table des pistes (table tracks) le nom, la durée en minutes des 20 pistes après la vingtième.

In [ ]:
curs.execute("SELECT Name, (Milliseconds/60)*0.001 FROM Tracks LIMIT 20, 20").description

In [ ]:
req6 = curs.fetchall()
req6 = pd.DataFrame(req6, columns = ['Name', 'Milliseconds'])
req6

07. Sélectionner montant total d'argent rapporté par la France (table invoices).

In [ ]:
curs.execute("SELECT SUM(Total) AS 'France_Total' FROM Invoices WHERE BillingCountry == 'France'").description

In [ ]:
req7 = curs.fetchall()
req7 = pd.DataFrame(req7, columns = ['France_Total'])
req7

08. Séléctionner le nombre total de clients (table customers) dont la colonne "company" n'a pas été renseignée.

In [ ]:
curs.execute("SELECT COUNT(*) AS 'Company Null Count' FROM Customers WHERE Company IS NULL").description

In [ ]:
req8 = curs.fetchall()
req8 = pd.DataFrame(req8, columns = ['Company Null Count'])
req8

09. Comment s'appelle le client (table customers) dont l'adresse (colonne address) est "Calle Lira, 198"?

In [ ]:
curs.execute("SELECT FirstName || ' ' || LastName AS FullName FROM Customers WHERE Address == 'Calle Lira, 198'").description

In [ ]:
req9 = curs.fetchall()
req9 = pd.DataFrame(req9, columns = ['FullName'])
req9

10. Mettre à jour le client retrouvé en question 09, mettre `Country = "Spain"` et `City = "Madrid"`.

In [84]:
curs.execute("UPDATE Customers SET Country = 'Spain', City = 'Madrid' WHERE Address == 'Calle Lira, 198'").description
curs.execute("SELECT * FROM Customers WHERE Address == 'Calle Lira, 198'").description

(('CustomerId', None, None, None, None, None, None),
 ('FirstName', None, None, None, None, None, None),
 ('LastName', None, None, None, None, None, None),
 ('Company', None, None, None, None, None, None),
 ('Address', None, None, None, None, None, None),
 ('City', None, None, None, None, None, None),
 ('State', None, None, None, None, None, None),
 ('Country', None, None, None, None, None, None),
 ('PostalCode', None, None, None, None, None, None),
 ('Phone', None, None, None, None, None, None),
 ('Fax', None, None, None, None, None, None),
 ('Email', None, None, None, None, None, None),
 ('SupportRepId', None, None, None, None, None, None))

In [85]:
req10 = curs.fetchall()
req10 = pd.DataFrame(req10, columns = ['CustomerId','FirstName','LastName','Company','Address','City','State','Country','PostalCode','Phone','Fax','Email','SupportRepId' ])
req10

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,57,Luis,Rojas,None,"Calle Lira, 198",Madrid,None,Spain,None,+56 (0)2 635 4444,None,luisrojas@yahoo.cl,5

11. Exécutez la requête suivante: `select customerid, billingcountry, sum(total) from invoices group by customerid;`. Décrire avec le maximum de détails possible le résultat renvoyé par cette requête.

In [90]:
curs.execute("SELECT CustomerId, BillingCountry, SUM(Total) AS 'TOTAL' from Invoices GROUP BY CustomerId").description

(('CustomerId', None, None, None, None, None, None),
 ('BillingCountry', None, None, None, None, None, None),
 ('TOTAL', None, None, None, None, None, None))

In [91]:
req11 = curs.fetchall()
req11 = pd.DataFrame(req11, columns = ['CustomerId','BillingCountry','TOTAL'])
req11.head()

   CustomerId  BillingCountry  TOTAL
0           1          Brazil  39.62
1           2         Germany  37.62
2           3          Canada  39.62
3           4          Norway  39.62
4           5  Czech Republic  40.62

12. Inspirez vous de la requête précédente et sélectionner dans la table invoices, pour chaque pays (colonne billingcountry), le nombre total de client (colonne customerid) correspondant, ie: "il y a combien de clients dans chaque pays?".

In [95]:
curs.execute("SELECT BillingCountry, COUNT(CustomerId) AS 'Total Client' FROM Invoices GROUP BY BillingCountry").description

(('BillingCountry', None, None, None, None, None, None),
 ('Total Client', None, None, None, None, None, None))

In [96]:
req12 = curs.fetchall()
req12 = pd.DataFrame(req12, columns = ['BillingCountry','Total Client'])
req12

    BillingCountry  Total Client
0        Argentina             7
1        Australia             7
2          Austria             7
3          Belgium             7
4           Brazil            35
5           Canada            56
6            Chile             7
7   Czech Republic            14
8          Denmark             7
9          Finland             7
10          France            35
11         Germany            28
12         Hungary             7
13           India            13
14         Ireland             7
15           Italy             7
16     Netherlands             7
17          Norway             7
18          Poland             7
19        Portugal            14
20           Spain             7
21          Sweden             7
22             USA            91
23  United Kingdom            21

13. Sélectionner le client (customerid, billingcountry) ayant rapporté le plus d'argent (table invoices).

In [111]:
curs.execute("SELECT CustomerId, BillingCountry, MAX(Total) AS 'Highest Total' FROM Invoices").description

(('CustomerId', None, None, None, None, None, None),
 ('BillingCountry', None, None, None, None, None, None),
 ('Highest Total', None, None, None, None, None, None))

In [112]:
req13 = curs.fetchall()
req13 = pd.DataFrame(req13, columns = ['CustomerId','BillingCountry','Highest Total'])
req13

   CustomerId  BillingCountry  Highest Total
0           6  Czech Republic          25.86

14. Dans la table tracks, sélectionner le nom de l'album (table albums), le genre musical (table genres), le type de média ( table media_types) pour la piste dont le trackid est 3503.

In [133]:
curs.execute("SELECT Name, GenreId, MediaTypeId FROM Tracks WHERE TrackId == 3503").description

(('Name', None, None, None, None, None, None),
 ('GenreId', None, None, None, None, None, None),
 ('MediaTypeId', None, None, None, None, None, None))

In [132]:
req14 = curs.fetchall()
req14 = pd.DataFrame(req14, columns = ['Name','GenreId','MediaTypeId'])
req14

            Name  GenreId  MediaTypeId
0  Koyaanisqatsi       10            2

In [140]:
curs.execute("SELECT Name FROM Genres WHERE GenreId == 10").description

(('Name', None, None, None, None, None, None),)

In [141]:
req15 = curs.fetchall()
req15 = pd.DataFrame(req15, columns = ['Name'])
req15

         Name
0  Soundtrack

In [144]:
curs.execute("SELECT Name FROM Media_Types WHERE MediaTypeId == 2").description

(('Name', None, None, None, None, None, None),)

In [145]:
req16 = curs.fetchall()
req16 = pd.DataFrame(req16, columns = ['Name'])
req16

                       Name
0  Protected AAC audio file